{
  "locations": [
    {
      "id": "Космический корабль",
      "description": "Вы просыпаетесь в своей каюте на борту звездолёта «Параллакс». Вокруг царит необычная тишина, нарушаемая лишь мягким гулом двигателей. Сквозь иллюминатор виднеется бесконечная чернота космоса, усыпанная мириадами звёзд. Однако что-то не так: аварийное освещение мерцает, а система жизнеобеспечения работает на резервной мощности. Вам предстоит выяснить, что случилось с кораблём и его экипажем, прежде чем ресурсы иссякнут.",
      "items": [
        {
          "id": "коммуникатор",
          "description": "Портативное устройство связи с другими членами экипажа"
        },
        {
          "id": "карта_корабля",
          "description": "Голографическая карта всех отсеков «Параллакса»"
        }
      ],
      "actions": [
        {
          "itemKey": "коммуникатор",
          "description": "Попытаться связаться с мостиком",
          "effect": {
            "type": "message",
            "value": "Связь отсутствует. Возможно, система коммуникаций повреждена."
          }
        }
      ],
      "neighbors": ["Инженерный отсек", "Медицинский центр"]
    },
    {
      "id": "Инженерный отсек",
      "description": "Инженерный отсек пульсирует мягким светом панелей управления. Обычно здесь шумно от работы генераторов и разговоров техников, но сейчас вы слышите лишь эхо своих шагов. На центральном мониторе мигает предупреждение о сбое в энергетической системе. Повсюду разбросаны инструменты, как будто все покинули помещение в спешке. Возможно, здесь вы найдёте ответы на свои вопросы.",
      "items": [
        {
          "id": "энергоячейка",
          "description": "Заряженная ячейка для восстановления энергии систем"
        }
      ],
      "actions": [
        {
          "itemKey": "энергоячейка",
          "description": "Вставить энергоячейку в главный генератор",
          "effect": {
            "type": "message",
            "value": "Основные системы питания восстановлены. Освещение и вентиляция работают в штатном режиме."
          }
        }
      ],
      "neighbors": ["Космический корабль", "Реакторный отсек"]
    },
    {
      "id": "Медицинский центр",
      "description": "Медицинский центр выглядит покинутым. Белоснежные стены и стерильные приборы создают ощущение нереальности происходящего. На одной из коек разбросаны медицинские инструменты и открытая аптечка. На мониторе жизненных показателей отображаются странные данные, не соответствующие человеческим параметрам. Возможно, здесь произошло что-то, что объяснит исчезновение экипажа?",
      "items": [
        {
          "id": "медсканер",
          "description": "Устройство для диагностики здоровья"
        }
      ],
      "actions": [
        {
          "itemKey": "медсканер",
          "description": "Просканировать себя",
          "effect": {
            "type": "increase_health",
            "value": "10"
          }
        }
      ],
      "neighbors": ["Космический корабль", "Лаборатория"]
    },
    {
      "id": "Реакторный отсек",
      "description": "Вы входите в реакторный отсек, сердце корабля. Огромный реактор издаёт низкий гул, но индикаторы показывают нестабильность в его работе. Защитные экраны опущены, и воздух наполнен запахом озона. На консолях отображаются сложные формулы и графики, указывающие на возможный перегруз. Без вмешательства реактор может выйти из строя, что приведёт к катастрофическим последствиям.",
      "items": [],
      "actions": [
        {
          "itemKey": "инструменты",
          "description": "Попытаться стабилизировать реактор",
          "effect": {
            "type": "message",
            "value": "Реактор стабилизирован, риск перегрузки устранён."
          }
        }
      ],
      "neighbors": ["Инженерный отсек"]
    },
    {
      "id": "Лаборатория",
      "description": "Лаборатория погружена в полумрак, лишь экраны компьютеров освещают пространство мерцающим светом. Повсюду разложены колбы с разноцветными жидкостями и сложное оборудование для исследований. На стене висит доска с записями и формулами, которые, похоже, связаны с экспериментами по пространственно-временным аномалиям. Возможно, именно здесь кроется разгадка происходящих событий.",
      "items": [
        {
          "id": "дневник_учёного",
          "description": "Записи главного научного сотрудника"
        },
        {
          "id": "ключ_от_обсерватории",
          "description": "Маленький ключ с гравировкой 'Обсерватория'"
        }
      ],
      "actions": [
        {
          "itemKey": "дневник_учёного",
          "description": "Прочитать дневник",
          "effect": {
            "type": "message",
            "value": "Вы узнали о неудачном эксперименте, который мог привести к исчезновению экипажа."
          }
        },
        {
          "itemKey": "ключ_от_обсерватории",
          "description": "Открыть доступ к обсерватории",
          "effect": {
            "type": "add_neighbor",
            "value": "Обсерватория"
          }
        }
      ],
      "neighbors": ["Медицинский центр"]
    },
    {
      "id": "Обсерватория",
      "description": "Обсерватория — это куполообразное помещение с панорамным видом на космос. Огромный телескоп направлен на загадочную туманность, которая светится необычным фиолетовым светом. На консоли отображаются данные сканирования этой области, показывающие аномальные энергетические всплески. В воздухе ощущается легкая вибрация, как будто сама реальность здесь нестабильна.",
      "items": [
        {
          "id": "энергетический_модуль",
          "description": "Устройство для нейтрализации аномальных энергий"
        }
      ],
      "actions": [
        {
          "itemKey": "энергетический_модуль",
          "description": "Активировать модуль для стабилизации аномалии",
          "effect": {
            "type": "message",
            "value": "Аномалия нейтрализована, связь с экипажем восстановлена."
          }
        }
      ],
      "neighbors": ["Лаборатория"]
    }
  ]
}
